START_TEXT = ("Привет! 🚜 Я бот, который поможет вам найти подходящие меры государственной поддержки "
              "для сельскохозяйственных производителей и кооперативов.\n\n"
              "Выберите категорию вашей деятельности:\n"
              "1️⃣ Самозанятый\n"
              "2️⃣ Личное подсобное хозяйство\n"
              "3️⃣ Индивидуальный предприниматель\n"
              "4️⃣ ИП или Глава КФХ\n"
              "5️⃣ Юридическое лицо или кооператив\n\n"
              "Чтобы узнать, что я умею, отправьте команду /help. \n"
              "Для отмены введите /cancel")

COMMANDS = ("Вот список команд которые я умею \n"
            "/start - Начать подбор финансирования \n"
            "/contact - Контакты для связи с нами \n"
            "/info - Информация о боте \n"
            "/navigation_map - Посмотреть дорожную карту бота \n"
            "/feedback - Обратная связь \n"
            "/vika - Команда специально для вики \n"
            "/egor - Егор захотел свою команду")

NAVIGATION_MAP = "Вот дорожная карта входа в чат-бота. Она поможет вам ориентироваться!"

INFO = ("Информация о государственной поддержке: [описание видов поддержки, условий получения, "
        "необходимых документов и т.д.]")

CONTACT = ("Если у вас есть вопросы, вы можете связаться с нами:\n\n"
           "📞 Телефон: +7 123 456 7890\n"
           "✉️ E-mail: support@example.com\n"
           "🕘 Часы работы: Пн-Пт с 9:00 до 18:00")

FEEDBACK = ("Мы ценим ваше мнение! Пожалуйста, напишите ваш отзыв или вопросы касательно "
            "получения грантов и мы обязательно на них ответим. Для отмены введите команду /cancel")

VIKA = "@villwe, тестируй меня полностью!"

EGOR = "@M0nyegva1 лох"

FEEDBACK_CANCEL = "Вы всегда можете оставить отзыв вызвав команду /feedback"

CANCEL = "Вы отменили выбор."

UNKNOWN_COMMAND = "Извините, я не понимаю эту команду. Введите /help для получения списка доступных команд."

WAIT_SPAM = "Подождите немного перед отправкой нового сообщения."

FEEDBACK_THANKS = "Спасибо за ваш отзыв!"

WRONG_CATEGORY = "Пожалуйста, выберите правильную категория. Для отмены введите /cancel"

CHOOSE_DURATION = ("Выберите период своей деятельности: \n"
                   "1️⃣ До года\n"
                   "2️⃣ Больше года\n"
                   )

START_KB = ["Самозанятый", "Личное подсобное хозяйство", "Индивидуальный предприниматель", "ИП или Глава КФХ",
            "Юридическое лицо или кооператив"]

DURATION_KB = ["Меньше года", "Больше года"]
