START_TEXT = ("Привет! 🚜 Я бот, который поможет вам найти подходящие меры государственной поддержки "
              "для сельскохозяйственных производителей и кооперативов.\n\n"
              "Выберите категорию вашей деятельности:\n"
              "1️⃣ Самозанятый\n"
              "2️⃣ Личное подсобное хозяйство\n"
              "3️⃣ Индивидуальный предприниматель\n"
              "4️⃣ ИП или Глава КФХ\n"
              "5️⃣ Юридическое лицо или кооператив\n\n"
              "Чтобы узнать, что я умею, отправьте команду /help. \n"
              "Для отмены введите /cancel")

COMMANDS = ("Вот список команд которые я умею: \n"
            "/start - Начать подбор финансирования \n"
            "/document - Получить документ с финансированиями \n"
            "/contact - Контакты для связи с нами \n"
            "/info - Информация о боте \n"
            "/navigation_map - Посмотреть дорожную карту бота \n"
            "/feedback - Обратная связь \n"
            "/vika -  Вызвать великого тестировщика \n"
            "/egor - Потролить Егора")

NAVIGATION_MAP = "Вот дорожная карта входа в чат-бота. Она поможет вам ориентироваться!"

ABOUT = ("Данный чат-бот, направлен на предоставление информационной поддержки субъектам малого и среднего бизнеса по"
         "вопросам мер государственной поддержки в агросекторе Самарской области. Бот консультирует субъекты "
         "относительно мер господдержки предпринимательства на селе, грантов, документации. \n"
         "Разработкой занимались студенты СамГТУ.")

CONTACT = ("Если у вас есть вопросы, вы можете связаться с нами:\n\n"
           "📞 Телефон: +7(846)-207-95-65\n"
           "🌐 Сайт: http://www.agro-inform.ru/agro-inform/selskiy-turizm/ \n" 
           "✉️ E-mail: samara-aris@mail.ru\n"
           "🕘 Часы работы: Пн-Пт с 9:00 до 18:00")

FEEDBACK = ("Мы ценим ваше мнение! Пожалуйста, напишите ваш отзыв или вопросы касательно "
            "получения грантов и мы обязательно на них ответим. Для отмены введите команду /cancel")

VIKA = "@villwe, тестируй меня полностью!"

EGOR = "@M0nyegva1 лох"

FEEDBACK_CANCEL = "Вы всегда можете оставить отзыв вызвав команду /feedback"

CANCEL = "Вы отменили выбор."

UNKNOWN_COMMAND = "Извините, я не понимаю эту команду. Введите /help для получения списка доступных команд."

WAIT_SPAM = "Подождите немного перед отправкой нового сообщения."

FEEDBACK_THANKS = "Спасибо за ваш отзыв!"

WRONG_CATEGORY = "Пожалуйста, выберите правильную категория. Для отмены введите /cancel"

CHOOSE_DURATION = ("Выберите период своей деятельности: \n"
                   "1️⃣ До года\n"
                   "2️⃣ Больше года\n"
                   )

START_KB = ["Самозанятый", "Личное подсобное хозяйство", "Индивидуальный предприниматель", "ИП или Глава КФХ",
            "Юридическое лицо или кооператив"]

DURATION_KB = ["Меньше года", "Больше года"]

FEEDBACK_ERROR = "Не получилось получить отзыв, попробуйте позже."

STARTUP = "Я родился."

SHUTDOWN = "Я умер."

DOCUMENT = "Документ в котором представлены все виды финансирования"
